常见运算符：+,-,*,/,%取余数;&按位与(同为1则1）;|按位或（有1则1）;^按位异或（相同则0，不同则1）；~按位取反；（int）a强制类型转换
+=（a=a+10)、-=、*=、/=、%=、<<=、>>=、&=、|=、^=;
单目操作符，！、&（取址）、sizeof等，只操作一个数或数组；
双目操作符，+、-、*、/等，操作两个数；&&逻辑与（都为真才真）；||逻辑或。
int main()
 {
	int a = 1;
	int b = a << 2;//<<左移，>>右移；指的是在2进制里面移动一位；从00001这种2进制数，向左移动2位，就是00100，所以b=4
	printf("%d\n", b);
	printf("%d\n", a);
	return 0;
  }
---------------------------
int main()
 {
	int a = 3;//011
	int b = 5;//101
	int c = a & b;//&按位与，011和101,结果为001
	printf("%d\n", c);
	return 0;
  }
---------------------------------
int main()//交换两数，不创建第三个变量
{
	int a = 3;
	int b = 5;
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("a:%d  b:%d", a, b);
}
-----------------------------------------
int main()//计算一个数是二进制时。有多少个1
{
	int a = 0;
	int i = 0;
	int count = 0;
	scanf_s("%d", &a);
	for (i = 0; i < 32; i++)
	{
		if(((a >> i) & 1) == 1)//右移一位，查看个位是否为1
		{
			count++;
		}
	}
	printf("%d", count);
}
------------------------------------------------
int main()
 {
	int a = 0;
	int b = 0;
	int max = 0;
	scanf_s("%d%d", &a, &b);
	max = (a > b ? a : b);//条件操作符（三目运算符），a大于b则为真，输出a，否则输出b
	printf("Max=%d\n", max);
	return 0;
  }
---------------------------------------
int main()//逻辑与，只要前面有0，后面就不再运算；逻辑或同理，有非零就不再运算
{
	int a = -1;
	int b = 2;
	int c = 3;
	int i = 0;
	i = ++a && ++b && c++;
	printf("a=%d\nb=%d\nc=%d\n", a, b, c);
	return 0;
}